In [1]:
import pandas as pd
import numpy as np

In [2]:
# read data
df=pd.read_csv('Pareto Input.csv')

In [3]:
df.shape

(4365, 5)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4365 entries, 0 to 4364
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  4365 non-null   int64
 1   First Name   4365 non-null   object
 2   Surname      4365 non-null   object
 3   Order ID     4365 non-null   int64
 4   Sales        4365 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 170.6+ KB

In [5]:
df.head()

   Customer ID First Name   Surname  Order ID    Sales
0          247     Kevina   Teresse      1087  699.192
1          562      Harry  O'Malley      1088   91.056
2          345  Kristofor   Sprigin      1089    3.928
3          394    Russell     Poore      1090   21.376
4          439     Kelsey     Fardo      1092  697.074

In [10]:
# drop Order ID
df.drop(columns='Order ID', inplace=True)

In [21]:
# groupby customer ID
df_new=df.groupby(['Customer ID','First Name','Surname'], as_index=False).sum('Sales').sort_values(by='Sales', ascending=False)

In [35]:
# add column '% of Total'
df_new['% of Total']=df_new['Sales']/df_new['Sales'].sum()*100

In [36]:
df_new.head()

,Customer ID,First Name,Surname,Sales,% of Total,Running % of Total Sales
615,701,Burnaby,Fruish,25043.050,1.258279,0.013
648,742,Boniface,Deboo,19052.218,0.957272,0.022
5,7,Vernon,Tomaskov,14473.571,0.727219,0.029
373,435,Stormi,Langman,14175.229,0.712229,0.037
588,670,Hayes,Treharne,14142.334,0.710577,0.044

In [39]:
# add accunulative sum of %
df_new['Running % of Total Sales']=df_new['% of Total'].cumsum().round(2)

In [43]:
# if Pareto Parameters is 80%
Pareto=80

df_80=df_new[df_new['Running % of Total Sales']<=Pareto]

In [44]:
# output
df_80.to_csv('Output_ParetoParameter80%.csv', index=False)